<template>
  <div class="tabs-container">
    <HomeTab :text="'Испытай себя, решая задачи по программированию. ' +
   'Каждая задача была создана cообществом, чтобы помочь тебе укрепить ' +
   'различные навыки программирования. Овладей и укроти твой текущий язык ' +
   'программирования или же расширь свои знания новым языком.'"
             image="home_content/mock-image.png"
             text-position="left"/>
    <HomeTab :text="'Испытай себя, решая задачи по программированию. ' +
   'Каждая задача была создана cообществом, чтобы помочь тебе укрепить ' +
   'различные навыки программирования. Овладей и укроти твой текущий язык ' +
   'программирования или же расширь свои знания новым языком.'"
             image="home_content/mock-image.png"
             text-position="right"/>
    <HomeTab :text="'Испытай себя, решая задачи по программированию. ' +
   'Каждая задача была создана cообществом, чтобы помочь тебе укрепить ' +
   'различные навыки программирования. Овладей и укроти твой текущий язык ' +
   'программирования или же расширь свои знания новым языком.'"
             image="home_content/mock-image.png"
             text-position="left"/>
    <HomeTab :text="'Испытай себя, решая задачи по программированию. ' +
   'Каждая задача была создана cообществом, чтобы помочь тебе укрепить ' +
   'различные навыки программирования. Овладей и укроти твой текущий язык ' +
   'программирования или же расширь свои знания новым языком.'"
             image="home_content/mock-image.png"
             text-position="right"/>
  </div>
</template>

<script>
import HomeTab from "@/components/home/HomeTab";

export default {
  name: "HomeContent",
  components: {
    HomeTab
  }
}
</script>

<style scoped>
.tabs-container {

}


</style>